order-service/old.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" 
    xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" 
    xmlns:tns="http://tempuri.org/" 
    xmlns:msb="http://schemas.microsoft.com/ws/06/2004/mspolicy/netbinary1" 
    xmlns:msf="http://schemas.microsoft.com/ws/2006/05/framing/policy">
    <soap:Body>
        <UpdateOrder xmlns="http://tempuri.org/">
            <licenseCode>PizzaHutApp</licenseCode>
            <language>en</language>
            <conceptID>3</conceptID>
            <order>
                <q247:AddressID xmlns:q247="http://schemas.datacontract.org/2004/07/SDM_SDK">10516085</q247:AddressID>
                <q247:ConceptID xmlns:q247="http://schemas.datacontract.org/2004/07/SDM_SDK">3</q247:ConceptID>
                <q247:CountryID xmlns:q247="http://schemas.datacontract.org/2004/07/SDM_SDK">1</q247:CountryID>
                <q247:CustomerID xmlns:q247="http://schemas.datacontract.org/2004/07/SDM_SDK">7698971</q247:CustomerID>
                <q247:DistrictID xmlns:q247="http://schemas.datacontract.org/2004/07/SDM_SDK">-1</q247:DistrictID>
                <q247:Entries xmlns:q247="http://schemas.datacontract.org/2004/07/SDM_SDK">
                    <q247:CEntry>
                        <q247:DealID>0</q247:DealID>
                        <q247:Entries>
                            <q247:CEntry>
                                <q247:DealID>0</q247:DealID>
                                <q247:ID>0</q247:ID>
                                <q247:ItemID>910001</q247:ItemID>
                                <q247:ModCode>NONE</q247:ModCode>
                                <q247:Name>Chicken Pc - Original</q247:Name>
                                <q247:QCComponent>1</q247:QCComponent>
                                <q247:QCInstanceID>599</q247:QCInstanceID>
                                <q247:QCLevel>0</q247:QCLevel>
                                <q247:QCProID>83</q247:QCProID>
                            </q247:CEntry>
                            <q247:CEntry>
                                <q247:DealID>0</q247:DealID>
                                <q247:ID>0</q247:ID>
                                <q247:ItemID>910001</q247:ItemID>
                                <q247:ModCode>NONE</q247:ModCode>
                                <q247:Name>Chicken Pc - Original</q247:Name>
                                <q247:QCComponent>1</q247:QCComponent>
                                <q247:QCInstanceID>599</q247:QCInstanceID>
                                <q247:QCLevel>0</q247:QCLevel>
                                <q247:QCProID>83</q247:QCProID>
                            </q247:CEntry>
                            <q247:CEntry>
                                <q247:DealID>0</q247:DealID>
                                <q247:ID>0</q247:ID>
                                <q247:ItemID>910002</q247:ItemID>
                                <q247:ModCode>NONE</q247:ModCode>
                                <q247:Name>Chicken Pc - Spicy</q247:Name>
                                <q247:QCComponent>1</q247:QCComponent>
                                <q247:QCInstanceID>790</q247:QCInstanceID>
                                <q247:QCLevel>0</q247:QCLevel>
                                <q247:QCProID>83</q247:QCProID>
                            </q247:CEntry>
                            <q247:CEntry>
                                <q247:DealID>0</q247:DealID>
                                <q247:ID>0</q247:ID>
                                <q247:ItemID>910002</q247:ItemID>
                                <q247:ModCode>NONE</q247:ModCode>
                                <q247:Name>Chicken Pc - Spicy</q247:Name>
                                <q247:QCComponent>1</q247:QCComponent>
                                <q247:QCInstanceID>790</q247:QCInstanceID>
                                <q247:QCLevel>0</q247:QCLevel>
                                <q247:QCProID>83</q247:QCProID>
                            </q247:CEntry>
                            <q247:CEntry>
                                <q247:DealID>0</q247:DealID>
                                <q247:ID>0</q247:ID>
                                <q247:ItemID>511001</q247:ItemID>
                                <q247:ModCode>NONE</q247:ModCode>
                                <q247:Name>Crispy Strips Original</q247:Name>
                                <q247:QCComponent>1</q247:QCComponent>
                                <q247:QCInstanceID>142</q247:QCInstanceID>
                                <q247:QCLevel>0</q247:QCLevel>
                                <q247:QCProID>83</q247:QCProID>
                            </q247:CEntry>
                            <q247:CEntry>
                                <q247:DealID>0</q247:DealID>
                                <q247:ID>0</q247:ID>
                                <q247:ItemID>511001</q247:ItemID>
                                <q247:ModCode>NONE</q247:ModCode>
                                <q247:Name>Crispy Strips Original</q247:Name>
                                <q247:QCComponent>1</q247:QCComponent>
                                <q247:QCInstanceID>142</q247:QCInstanceID>
                                <q247:QCLevel>0</q247:QCLevel>
                                <q247:QCProID>83</q247:QCProID>
                            </q247:CEntry>
                            <q247:CEntry>
                                <q247:DealID>0</q247:DealID>
                                <q247:ID>0</q247:ID>
                                <q247:ItemID>511002</q247:ItemID>
                                <q247:ModCode>NONE</q247:ModCode>
                                <q247:Name>Crispy Strips Spicy</q247:Name>
                                <q247:QCComponent>1</q247:QCComponent>
                                <q247:QCInstanceID>546</q247:QCInstanceID>
                                <q247:QCLevel>0</q247:QCLevel>
                                <q247:QCProID>83</q247:QCProID>
                            </q247:CEntry>
                            <q247:CEntry>
                                <q247:DealID>0</q247:DealID>
                                <q247:ID>0</q247:ID>
                                <q247:ItemID>511002</q247:ItemID>
                                <q247:ModCode>NONE</q247:ModCode>
                                <q247:Name>Crispy Strips Spicy</q247:Name>
                                <q247:QCComponent>1</q247:QCComponent>
                                <q247:QCInstanceID>546</q247:QCInstanceID>
                                <q247:QCLevel>0</q247:QCLevel>
                                <q247:QCProID>83</q247:QCProID>
                            </q247:CEntry>
                        </q247:Entries>
                        <q247:ID>0</q247:ID>
                        <q247:ItemID>410030</q247:ItemID>
                        <q247:ModCode>NONE</q247:ModCode>
                        <q247:Name>Better together</q247:Name>
                        <q247:QCComponent>1</q247:QCComponent>
                        <q247:QCInstanceID>128</q247:QCInstanceID>
                        <q247:QCLevel>0</q247:QCLevel>
                        <q247:QCProID>83</q247:QCProID>
                    </q247:CEntry>
                    <q247:CEntry>
                        <q247:DealID>0</q247:DealID>
                        <q247:ID>0</q247:ID>
                        <q247:ItemID>710003</q247:ItemID>
                        <q247:ModCode>NONE</q247:ModCode>
                        <q247:Name>Chocolate Chip Cookie</q247:Name>
                        <q247:QCComponent>2</q247:QCComponent>
                        <q247:QCInstanceID>128</q247:QCInstanceID>
                        <q247:QCLevel>0</q247:QCLevel>
                        <q247:QCProID>83</q247:QCProID>
                    </q247:CEntry>
                    <q247:CEntry>
                        <q247:DealID>0</q247:DealID>
                        <q247:ID>0</q247:ID>
                        <q247:ItemID>710003</q247:ItemID>
                        <q247:ModCode>NONE</q247:ModCode>
                        <q247:Name>Chocolate Chip Cookie</q247:Name>
                        <q247:QCComponent>3</q247:QCComponent>
                        <q247:QCInstanceID>128</q247:QCInstanceID>
                        <q247:QCLevel>0</q247:QCLevel>
                        <q247:QCProID>83</q247:QCProID>
                    </q247:CEntry>
                    <q247:CEntry>
                        <q247:DealID>0</q247:DealID>
                        <q247:ID>0</q247:ID>
                        <q247:ItemID>510004</q247:ItemID>
                        <q247:ModCode>NONE</q247:ModCode>
                        <q247:Name>Regular Fries</q247:Name>
                        <q247:QCComponent>4</q247:QCComponent>
                        <q247:QCInstanceID>128</q247:QCInstanceID>
                        <q247:QCLevel>0</q247:QCLevel>
                        <q247:QCProID>83</q247:QCProID>
                    </q247:CEntry>
                    <q247:CEntry>
                        <q247:DealID>0</q247:DealID>
                        <q247:ID>0</q247:ID>
                        <q247:ItemID>510004</q247:ItemID>
                        <q247:ModCode>NONE</q247:ModCode>
                        <q247:Name>Regular Fries</q247:Name>
                        <q247:QCComponent>5</q247:QCComponent>
                        <q247:QCInstanceID>128</q247:QCInstanceID>
                        <q247:QCLevel>0</q247:QCLevel>
                        <q247:QCProID>83</q247:QCProID>
                    </q247:CEntry>
                    <q247:CEntry>
                        <q247:DealID>0</q247:DealID>
                        <q247:ID>0</q247:ID>
                        <q247:ItemID>510001</q247:ItemID>
                        <q247:ModCode>NONE</q247:ModCode>
                        <q247:Name>Coleslaw Salad Small</q247:Name>
                        <q247:QCComponent>6</q247:QCComponent>
                        <q247:QCInstanceID>128</q247:QCInstanceID>
                        <q247:QCLevel>0</q247:QCLevel>
                        <q247:QCProID>83</q247:QCProID>
                    </q247:CEntry>
                    <q247:CEntry>
                        <q247:DealID>0</q247:DealID>
                        <q247:ID>0</q247:ID>
                        <q247:ItemID>510001</q247:ItemID>
                        <q247:ModCode>NONE</q247:ModCode>
                        <q247:Name>Coleslaw Salad Small</q247:Name>
                        <q247:QCComponent>7</q247:QCComponent>
                        <q247:QCInstanceID>128</q247:QCInstanceID>
                        <q247:QCLevel>0</q247:QCLevel>
                        <q247:QCProID>83</q247:QCProID>
                    </q247:CEntry>
                    <q247:CEntry>
                        <q247:DealID>0</q247:DealID>
                        <q247:ID>0</q247:ID>
                        <q247:ItemID>600002</q247:ItemID>
                        <q247:ModCode>NONE</q247:ModCode>
                        <q247:Name>Pepsi Regular</q247:Name>
                        <q247:QCComponent>8</q247:QCComponent>
                        <q247:QCInstanceID>128</q247:QCInstanceID>
                        <q247:QCLevel>0</q247:QCLevel>
                        <q247:QCProID>83</q247:QCProID>
                    </q247:CEntry>
                    <q247:CEntry>
                        <q247:DealID>0</q247:DealID>
                        <q247:ID>0</q247:ID>
                        <q247:ItemID>600002</q247:ItemID>
                        <q247:ModCode>NONE</q247:ModCode>
                        <q247:Name>Pepsi Regular</q247:Name>
                        <q247:QCComponent>9</q247:QCComponent>
                        <q247:QCInstanceID>128</q247:QCInstanceID>
                        <q247:QCLevel>0</q247:QCLevel>
                        <q247:QCProID>83</q247:QCProID>
                    </q247:CEntry>
                </q247:Entries>
                <q247:OrderID xmlns:q247="http://schemas.datacontract.org/2004/07/SDM_SDK">0</q247:OrderID>
                <q247:OrderMode xmlns:q247="http://schemas.datacontract.org/2004/07/SDM_SDK">2</q247:OrderMode>
                <q247:OrderType xmlns:q247="http://schemas.datacontract.org/2004/07/SDM_SDK">0</q247:OrderType>
                <q247:ProvinceID xmlns:q247="http://schemas.datacontract.org/2004/07/SDM_SDK">7</q247:ProvinceID>
                <q247:ServiceCharge xmlns:q247="http://schemas.datacontract.org/2004/07/SDM_SDK">0</q247:ServiceCharge>
                <q247:StoreID xmlns:q247="http://schemas.datacontract.org/2004/07/SDM_SDK">1218</q247:StoreID>
                <q247:StreetID xmlns:q247="http://schemas.datacontract.org/2004/07/SDM_SDK">315</q247:StreetID>
            </order>
            <autoApprove>true</autoApprove>
            <useBackupStoreIfAvailable>true</useBackupStoreIfAvailable>
            <orderNotes1>826</orderNotes1>
            <orderNotes2>
                <_bsontype>ObjectID</_bsontype>
                <id>
                    <0>94</0>
                    <1>127</1>
                    <2>53</2>
                    <3>142</3>
                    <4>203</4>
                    <5>237</5>
                    <6>151</6>
                    <7>146</7>
                    <8>46</8>
                    <9>51</9>
                    <10>1</10>
                    <11>178</11>
                </id>
            </orderNotes2>
            <creditCardPaymentbool>false</creditCardPaymentbool>
            <isSuspended>false</isSuspended>
            <menuTemplateID>17</menuTemplateID>
        </UpdateOrder>
    </soap:Body>
</soap:Envelope>